<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 流年 <liu21st@gmail.com>
// +----------------------------------------------------------------------

// 应用公共文件

//因为经常要返回给前端请求的数据,所以封装此方法,此方法需要四个参数,状态,信息,数据和状态码,状态码默认值为200
function show($status,$msg,$data,$httpCode = 200 ){
    $res = [
        'status' => $status,
        'msg' => $msg,
        'data' => $data,
    ];
    //以json格式返回数据
    return json($res,$httpCode);
}